Tekla Open API Reference for Tekla Structures 2025
ControlPolycurve Constructor
 Initializes a new instance of the ControlPolycurve class.
The default values are as follows:
Color = ControlObjectColorEnum.BLUE;
LineType = LineType.DashDot;
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlPolycurve()
Public Sub New
See Also
Reference
ControlPolycurve Class
ControlPolycurve Overload
Tekla.Structures.Model Namespace